# GetParameterFormula Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeDefinition..::..GetParameterFormula Method
RebarShapeDefinition Class See Also
---
Return the parameter's formula, if one is associated with it.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2009
# Syntax
C#
---
```text
public string GetParameterFormula(
	ElementId paramId
)
```

Visual Basic
---
```text
Public Function GetParameterFormula ( _
	paramId As ElementId _
) As String
```

Visual C++
---
```text
public:
String^ GetParameterFormula(
	ElementId^ paramId
)
```

# ### Parameters
paramId
    Type: Autodesk.Revit.DB..::..ElementId Id of a parameter in the definition.
# ### Return Value
The formula, or an empty string if there is no formula for the parameter.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | This RebarShapeDefinition does not have a value for the parameter paramId. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RebarShapeDefinition Class
Autodesk.Revit.DB.Structure Namespace